## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_account.db must be replaced
-/+ resource "azurerm_cosmosdb_account" "db" {
      ~ connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      ~ enable_automatic_failover                    = true -> false
      ~ endpoint                                     = "https://ruut-tf-cosmos-db-39756.documents.azure.com:443/" -> (known after apply)
      ~ id                                           = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.DocumentDB/databaseAccounts/ruut-tf-cosmos-db-39756" -> (known after apply)
      ~ kind                                         = "MongoDB" -> "GlobalDocumentDB" # forces replacement
      ~ mongo_server_version                         = "3.6" -> (known after apply)
        name                                         = "ruut-tf-cosmos-db-39756"
      - network_acl_bypass_ids                       = [] -> null
      ~ primary_key                                  = (sensitive value)
      ~ primary_mongodb_connection_string            = (sensitive value)
      ~ primary_readonly_key                         = (sensitive value)
      ~ primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      ~ read_endpoints                               = [
          - "https://ruut-tf-cosmos-db-39756-swedencentral.documents.azure.com:443/",
        ] -> (known after apply)
      ~ secondary_key                                = (sensitive value)
      ~ secondary_mongodb_connection_string          = (sensitive value)
      ~ secondary_readonly_key                       = (sensitive value)
      ~ secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      - tags                                         = {} -> null
      ~ write_endpoints                              = [
          - "https://ruut-tf-cosmos-db-39756-swedencentral.documents.azure.com:443/",
        ] -> (known after apply)
        # (13 unchanged attributes hidden)

      - analytical_storage {
          - schema_type = "FullFidelity" -> null
        }

      - backup {
          - interval_in_minutes = 240 -> null
          - retention_in_hours  = 8 -> null
          - storage_redundancy  = "Geo" -> null
          - type                = "Periodic" -> null
        }

      - capabilities { # forces replacement
          - name = "EnableMongo" -> null
        }
      - capabilities { # forces replacement
          - name = "MongoDBv3.4" -> null
        }
      + capabilities { # forces replacement
          + name = "EnableServerless"
        }

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "ruut-tf-cosmos-db-39756-swedencentral" -> null
          - location          = "swedencentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "swedencentral"
          + zone_redundant    = false
        }

        # (1 unchanged block hidden)
    }

  # module.cosmos.azurerm_cosmosdb_mongo_collection.lagfest will be destroyed
  # (because azurerm_cosmosdb_mongo_collection.lagfest is not in configuration)
  - resource "azurerm_cosmosdb_mongo_collection" "lagfest" {
      - account_name           = "ruut-tf-cosmos-db-39756" -> null
      - analytical_storage_ttl = 0 -> null
      - database_name          = "main" -> null
      - default_ttl_seconds    = 777 -> null
      - id                     = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.DocumentDB/databaseAccounts/ruut-tf-cosmos-db-39756/mongodbDatabases/main/collections/ruut-lagfest" -> null
      - name                   = "ruut-lagfest" -> null
      - resource_group_name    = "rg-prod" -> null
      - shard_key              = "uniqueKey" -> null
      - system_indexes         = [
          - {
              - keys   = [
                  - "_id",
                ]
              - unique = true
            },
        ] -> null
      - throughput             = 400 -> null

      - index {
          - keys   = [
              - "_id",
            ] -> null
          - unique = true -> null
        }
    }

  # module.cosmos.azurerm_cosmosdb_mongo_database.main will be destroyed
  # (because azurerm_cosmosdb_mongo_database.main is not in configuration)
  - resource "azurerm_cosmosdb_mongo_database" "main" {
      - account_name        = "ruut-tf-cosmos-db-39756" -> null
      - id                  = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.DocumentDB/databaseAccounts/ruut-tf-cosmos-db-39756/mongodbDatabases/main" -> null
      - name                = "main" -> null
      - resource_group_name = "rg-prod" -> null
      - throughput          = 400 -> null
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.lagfest will be created
  + resource "azurerm_cosmosdb_sql_container" "lagfest" {
      + account_name        = "ruut-tf-cosmos-db-39756"
      + database_name       = "main"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "ruut-lagfest"
      + partition_key_path  = "/definition/id"
      + resource_group_name = "rg-prod"
      + throughput          = (known after apply)
    }

  # module.cosmos.azurerm_cosmosdb_sql_database.main will be created
  + resource "azurerm_cosmosdb_sql_database" "main" {
      + account_name        = "ruut-tf-cosmos-db-39756"
      + id                  = (known after apply)
      + name                = "main"
      + resource_group_name = "rg-prod"
      + throughput          = (known after apply)
    }

  # module.function.azurerm_linux_function_app.backend will be updated in-place
  ~ resource "azurerm_linux_function_app" "backend" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags" = "EnableWorkerIndexing" -> null
        }
        id                                             = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.Web/sites/ruut-backend-function-app"
        name                                           = "ruut-backend-function-app"
        tags                                           = {}
        # (27 unchanged attributes hidden)

      - connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```
</details>